Repository: GitoriousLispBackup/common-lisp-controller
Catalog: debian/po/*.po
Languages: fr, nl

source: Only build lisp libraries daily
fr: Limiter la construction des bibliothèques LISP à une fois par jour ?
nl: Slechts dagelijks bouwen van lisp-bibliotheken

source: Should all lisp libraries only be build by the nightly cronjob? If so all interactive user requests to recompile a library (by requiring it) will fail.
fr: L'ensemble des bibliothèques LISP peuvent n'être recompilées que par une tâche quotidienne de cron. Dans ce cas, les tentatives interactives de recompilation d'une bibliothèque par les utilisateurs échoueront.
nl: Moeten alle lisp-bibliotheken slechts gebouwd worden door de nachtelijke cronjob? Indien ja, dan zullen alle interactieve gebruikersaanvragen om een bibliotheek te hercompileren falen (door ze nodig te hebben).

source: Setting this option might be advised if you want the update to finish early. Later you can manually run the daily cronjob to build all the libraries for the users.
fr: Il peut être judicieux d'activer cette option si vous souhaitez que la mise à jour se termine rapidement. Ultérieurement, vous pourrez lancer vous-même cette tâche quotidienne de cron pour construire toutes les bibliothèques pour les utilisateurs.
nl: Deze optie aanzetten kan geadviseerd worden als u de opwaardering vroegtijdig wilt beëindigen. Later kunt u de dagelijkse cronjob handmatig uitvoeren om alle bibliotheken te bouwen voor de gebruikers.

source: Note that removal of libraries or implementations is immediate.
fr: Veuillez noter que la suppression des bibliothèques et des mises en oeuvre (« implementations ») reste immédiate.
nl: Merk op dat het verwijderen van bibliotheken of implementaties onmiddellijk gebeurt.

source: Autobuild LISP libraries for all LISP compilers?
fr: Construction automatique des bibliothèques pour tous les compilateurs LISP ?
nl: Automatisch bouwen van LISP-bibliotheken voor alle LISP-vertalers?

source: Should all libraries for all compilers be rebuilt as they are installed?
fr: Faut-il reconstruire toutes les bibliothèques de tous les compilateurs lors de leur installation ?
nl: Moeten alle bibliotheken voor alle vertalers opnieuw gebouwd worden wanneer ze geïnstalleerd worden?

source: Note that this can take a significant amount of time on every install.
fr: Veuillez noter que cela peut prendre un temps non négligeable à chaque installation.
nl: Merk op dat dit een significante hoeveelheid tijd kan bedragen bij elke installatie.

source: Autobuilding control note
fr: Note à propos du contrôle de la construction automatique
nl: Automatisch bouwen van controle-nota's

source: Autobuilding packages is controlled with placing files in certain places. You can create those files yourself with "touch".
fr: La construction automatique des paquets est gérée en plaçant des fichiers à certains endroits. Ces fichiers peuvent être créés avec « touch ».
nl: Automatisch bouwen van pakketten wordt gestuurd door het plaatsen van bestanden op bepaalde plaatsen. U kunt deze bestanden zelf aanmaken met "touch".

source: The rules are:
fr: Les règles suivantes sont appliquées :
nl: De regels zijn:

source: If the file /etc/common-lisp/autobuild exists all packages for all compilers will be built.
fr: - si le fichier /etc/common-lisp/autobuild existe, tous les paquets de tous les compilateurs seront construits ;
nl: als het bestand /etc/common-lisp/autobuild bestaat, dan zullen alle pakketten voor alle vertalers worden gebouwd;

source: If for an implementation foo the file /etc/common-lisp/foo/autobuild exists all packages for that implementation will be build.
fr: - si, pour le compilateur toto, le fichier /etc/common-lisp/toto/autobuild existe, tous les paquets seront reconstruits pour ce compilateur ;
nl: als voor een implementatie foo het bestand /etc/common-lisp/foo/autobuild bestaat, dan zullen alle pakketten voor die implementatie gebouwd worden;

source: If for an implementation foo and a package bar the file /etc/common-lisp/foo/bar/autobuild exists this package will be autobuild for that implementation.
fr: - si, pour le compilateur toto et le paquet titi, le fichier /etc/common-lisp/toto/titi/autobuild existe, ce paquet sera reconstruit pour ce compilateur.
nl: als voor een implementatie foo en een pakket bar het bestand /etc/common-lisp/foo/bar/autobuild bestaat, dan zal dit pakket automatisch worden gebouwd voor die implementatie.

source: Unknown
fr: Inconnu
nl: Onbekend

source: The short common LISP site name
fr: Nom court du site LISP commun
nl: De korte common LISP-sitenaam

source: You can configure what the common LISP implementations are going to use as "short site name". This is mostly unused except in some error reporting tools.
fr: Les compilateurs LISP communs utiliseront ce nom comme « nom court de site » (« short site name »). Cela est pratiquement inutilisé sauf par certains outils de vérification d'erreurs.
nl: U kunt configureren wat de common LISP-implementaties gaan gebruiken als "short site name". Dit wordt meestal niet gebruikt, behalve in enkele foutrapporteringshulpmiddelen.

source: Site name not initialized
fr: Nom de site indéfini
nl: Sitenaam niet geïnitialiseerd

source: The long common LISP site name
fr: Nom long du site LISP commun
nl: De lange common LISP-sitenaam

source: You can configure what the common LISP implementations are going to use as "long site name". This is mostly unused except in some error reporting tools.
fr: Les compilateurs LISP communs utiliseront ce nom comme « nom long de site » (« long site name »). Cela est pratiquement inutilisé sauf par certains outils de vérification d'erreurs.
nl: U kunt configureren wat de common LISP-implementaties gaan gebruiken als "long site name". Dit wordt meestal niet gebruikt, behalve in enkele foutrapporteringshulpmiddelen.
